Repository: AaronMarcel/TDAmTrade_Zorro_Plugin
Catalog: TDAmeritradeZorro/Resources/*.resx
Languages: de, es, fr

source: Access Token
de: Zugangstoken
es: Token de acceso
fr: Jeton d'accès

# ACCOUNT_NUM
source: Account #
de: Konto #
es: Cuenta #
fr: Compte #

# ALREADY_SUBSCRIBED
source: already subscribed to
de: bereits abonniert
es: ya suscrito a
fr: déjà abonné à

source: at
de: beim
es: a
fr: à

source: Authenticating user
de: Benutzer authentifizieren
es: Autenticando usuario
fr: Authentification de l'utilisateur

source: Broker Account
de: Brokerkonto
es: Cuenta de corredor
fr: Compte de courtier

source: Broker Asset
es: Agente de bienes
fr: Actif de courtier

source: Broker Buy2
fr: Courtier Buy2

source: Broker History2
fr: Historique du courtier2

source: Broker Login
es: Inicio de sesión de corredor
fr: Connexion courtier

source: Broker Open
de: Broker offen
fr: Courtier ouvert

source: Broker Time
de: Maklerzeit
es: Tiempo de corredor
fr: Temps du courtier

source: Broker Trade
de: Maklerhandel
fr: Commerce de courtier

source: Buy
de: Kaufen
es: Comprar
fr: Acheter

source: Buying
de: Kauf
es: Comprando
fr: Achat

source: Cancel
de: Stornieren
es: Cancelar
fr: Annuler

source: canceled
de: abgebrochen
es: cancelado
fr: annulé

source: canceling
de: stornieren
es: cancelado
fr: annulation

# CANCELING_ORDER
source: Canceling order for
de: Bestellung stornieren für
es: Cancelar orden para
fr: Annulation de la commande de

# CANNOT_GET_INTEREST_RATES
source: Currency interest rates cannot be obtained
de: Währungszinssätze können nicht erhalten werden
es: No se pueden obtener tasas de interés de divisas.
fr: Impossible d'obtenir les taux d'intérêt sur les devises

source: closed
de: geschlossen
es: cerrado
fr: fermé

# CONN_LOST
source: Connection to TD Ameritrade is lost
de: Die Verbindung zu TD Ameritrade ist unterbrochen
es: Se ha perdido la conexión con TD Ameritrade
fr: La connexion à TD Ameritrade est perdue

# CURRENT_UTC_TIME
source: The current UTC time is
de: Die aktuelle UTC-Zeit ist
es: La hora actual UTC es
fr: L'heure UTC actuelle est

source: Enabling browser emulation
de: Browser-Emulation aktivieren
es: Habilitar la emulación del navegador
fr: Activation de l'émulation du navigateur

source: Error
fr: Erreur

# ERROR_FOR_QUOTE
source: Unspecificied error occurred retrieving quote information for
de: Beim Abrufen der Angebotsinformationen für ist ein nicht spezifizierter Fehler aufgetreten
es: Se produjo un error no especificado al recuperar la información de cotización para
fr: Une erreur non spécifiée s'est produite lors de la récupération des informations de devis pour

# ERRORS_IN_TESTS
source: ERRORS DETECTED IN PLUG-IN TESTS
de: FEHLER IN PLUG-IN-TESTS ERKANNT
es: ERRORES DETECTADOS EN PRUEBAS ENCHUFABLES
fr: ERREURS DÉTECTÉES DANS LES ESSAIS DE PLUG-IN

source: Exiting
de: Verlassen
es: Salir
fr: Quitter

source: Failure
de: Fehler
es: Fracaso
fr: Échec

source: file
de: Datei
es: archivo
fr: fichier

# FILE_IO_ERROR
source: File i/0 error
de: Datei I/O Fehler
es: Error de archivo I/O
fr: Erreur de fichier I/O

source: file not found
de: Datei nicht gefunden
es: archivo no encontrado
fr: Fichier non trouvé

source: for
de: zum
es: para
fr: pour

source: found
de: gefunden
es: encontró
fr: a trouvé

source: from
de: von
es: desde
fr: de

# GET_NYSE_HOURS
source: Get the NYSE hours
de: Holen Sie sich die NYSE Stunden
es: Obtenga las horas de NYSE
fr: Obtenez les heures de NYSE

source: Get position
de: Position bekommen
es: Obtener posición
fr: Obtenir une position

# GET_USER_ACCT_INFO
source: Get user account information
de: Informationen zum Benutzerkonto abrufen
es: Obtener información de la cuenta del usuario
fr: Obtenir des informations sur le compte utilisateur

source: getting
de: bekommen
es: consiguiendo
fr: avoir

source: Getting access token
de: Zugriffstoken erhalten
es: Obtener token de acceso
fr: Obtenir un jeton d'accès

source: Getting new access token
de: Neues Zugriffstoken erhalten
es: Obteniendo nuevo token de acceso
fr: Obtenir un nouveau jeton d'accès

source: in
de: im
es: en
fr: dans

source: incorrect format
de: falsches Format
es: formato incorrecto
fr: format incorrect

# INTEREST_RATE_INIT
source: Initializing interest rates
de: Zinssätze initialisieren
es: Inicializando tasas de interés
fr: Initialisation des taux d'intérêt

source: Limit
de: Grenze
es: Límite
fr: Limite

source: list
de: Liste
es: lista
fr: liste

# LOAD_AND_SYNC
source: Loading and synchronization of trades file
de: Laden und Synchronisieren der Handelsdatei
es: Carga y sincronización de archivo de oficios
fr: Chargement et synchronisation du fichier des métiers

# LOADING_LOCAL_TRADES
source: Loading local trades file
de: Laden der lokalen Handelsdatei
es: Cargando archivo de comercios locales
fr: Chargement du fichier des métiers locaux

# LOADING_TRADES_FILE
source: Loading the JSON trades file
de: Laden der JSON-Handelsdatei
es: Cargando el archivo de operaciones JSON
fr: Chargement du fichier métiers JSON

source: Market
de: Markt
es: Mercado
fr: Marché

source: Market hours
de: Marktzeiten
es: Horas de mercado
fr: Heures de marché

# MSFT_PRICE_HISTORY
source: Retrieving historical price data on MSFT
de: Abrufen historischer Preisdaten zu MSFT
es: Recuperando datos históricos de precios en MSFT
fr: Récupération des données de prix historiques sur MSFT

source: Net position for
de: Nettoposition für
es: Posición neta para
fr: Position nette pour

# NO_ID_RETURNED
source: No Order # returned for trading of
de: Es wurde keine Bestellnummer für den Handel von zurückgegeben
es: No se devuelve ningún pedido para el comercio de
fr: Aucun ordre retourné pour échange de

# NO_TICKS_RETURNED
source: No ticks returned for
de: Es wurden keine Zecken zurückgegeben
es: No se devolvieron las garrapatas para
fr: Aucune tique retournée pour

source: not executed
de: nicht ausgeführt
es: sin ejecutar
fr: Non exécuté

source: not found
de: nicht gefunden
es: extraviado
fr: pas trouvé

source: not open
de: nicht offen
es: no abierto
fr: pas ouverte

source: open
de: öffnen
es: abierto
fr: ouvert

source: order
de: Auftrag
es: orden
fr: ordre

# PLACING_ORDER
source: Placing order for
de: Bestellung aufgeben für
es: Poner orden para
fr: Passer une commande pour

source: Placing order for
de: Bestellung aufgeben für
es: Poner orden para
fr: Passer une commande pour

source: price history
de: Preisentwicklung
es: historial de precios
fr: historique des prix

source: price of
de: Preis von
es: precio de
fr: prix de

source: Reading
de: lesen
es: Leyendo
fr: En train de lire

# READING_SETTINGS
source: Reading SETTINGS file
de: SETTINGS-Datei lesen
es: Lectura del archivo de CONFIGURACIÓN
fr: Lecture du fichier SETTINGS

# READING_SETTINGS_FILE
source: Reading the SETTINGS file
de: Lesen der SETTINGS-Datei
es: Leer el archivo de configuración
fr: Lecture du fichier SETTINGS

source: Refresh Token
de: Token aktualisieren
es: Actualizar token
fr: Actualiser le jeton

source: rejected
de: abgelehnt
es: rechazado
fr: rejeté

# RETRIEVE_ACCT_INFO
source: Retrieving user account information for TDA #
de: Abrufen von Benutzerkontoinformationen für TDA #
es: Recuperando información de cuenta de usuario para TDA #
fr: Récupération des informations de compte d'utilisateur pour TDA #

source: Retrieving
de: Abrufen
es: Recuperando
fr: Récupération

# RETRIEVING_INFO_FOR
source: Retrieving information for
de: Informationen abrufen für
es: Recuperando información para
fr: Récupération d'informations pour

source: Return code
de: Rückgabe Code
es: Código de retorno
fr: Code de retour

source: Sell
de: Verkaufen
es: Vender
fr: Vendre

source: Selling
de: Verkauf
es: De venta
fr: Vente

# SERVER_UTC_CONVERTED
source: Server UTC time (Converted)
de: Server-UTC-Zeit (konvertiert)
es: Hora UTC del servidor (convertida)
fr: Heure UTC du serveur (convertie)

# SERVER_UTC_OLE
source: Server UTC time (OLE)
de: Server-UTC-Zeit (OLE)
es: Hora UTC del servidor (OLE)
fr: Heure UTC du serveur (OLE)

source: Settings
de: die Einstellungen
es: Configuraciones
fr: Réglages

source: shares of
de: Aktien von
es: acciones de
fr: parts de

source: Status
es: Estado
fr: Statut

# SUBSCRIBING_TO
source: Subscribing to asset
de: Asset abonnieren
es: Suscribirse al activo
fr: Abonnement à l'actif

source: Success
de: Erfolg
es: Éxito
fr: r

# SUCCESS_IN_TESTS
source: ALL PLUG-IN TESTS SUCCESSFUL
de: ALLE PLUG-IN-TESTS ERFOLGREICH
es: TODAS LAS PRUEBAS ENCHUFABLES SON EXITOSAS
fr: TOUS LES TESTS DE PLUG-IN SONT RÉUSSIS

# SYNCING
source: Synchronizing
de: Synchronisieren
es: Sincronizando
fr: Synchronisation

# SYNCING_LOCAL_TRADES
source: Syncing local trades file with TD Ameritrade trades.
de: Synchronisieren der lokalen Handelsdatei mit TD Ameritrade-Geschäften.
es: Sincronizar el archivo de operaciones locales con las operaciones de TD Ameritrade.
fr: Synchronisation du fichier des transactions locales avec les transactions TD Ameritrade.

source: Test
de: Prüfung
es: Prueba
fr: Tester

# TEST_ACCESS_TOKEN_FROM_REFRESH
source: Access token obtained from refresh token
es: Token de acceso obtenido del token de actualización
fr: Jeton d'accès obtenu à partir du jeton d'actualisation

# TEST_ASSET_FAILURE
source: FAILURE: Subscribing to
de: FEHLER: Abonnieren
es: FALLA: Suscribirse a
fr: ÉCHEC: abonnement à

# TEST_ASSET_INFO_FAILURE
source: FAILURE: Getting asset information for
de: FEHLER: Abrufen von Asset-Informationen für
es: FALLA: Obtener información de activos para
fr: ÉCHEC: obtenir des informations sur les actifs pour

# TEST_ASSET_SUCCESS
source: SUCCESS: Subscribing to
de: ERFOLG: Abonnieren
es: ÉXITO: ​​Suscribirse a
fr: SUCCÈS: S'abonner à

# TEST_AUTHENTICATION_AUTH_TOKEN
source: User authenticated. Auth token obtained.
de: Benutzer authentifiziert. Auth-Token erhalten.
es: Usuario autenticado. Token de autenticación obtenido.
fr: Utilisateur authentifié. Jeton d'authentification obtenu.

# TEST_AUTHENTICATION_FAILURE
source: User not authenticated
de: Benutzer nicht authentifiziert
es: Usuario no autenticado
fr: Utilisateur non authentifié

# TEST_NO_ACCESS_TOKEN_FROM_REFRESH
source: Access token not obtained from refresh token
es: Token de acceso no obtenido del token de actualización
fr: Jeton d'accès non obtenu à partir du jeton d'actualisation

# TEST_ORDER_INFO_FAILURE
source: FAILURE: Retrieving order information
de: FEHLER: Abrufen von Bestellinformationen
es: FALLA: Recuperando información del pedido
fr: ÉCHEC: récupération des informations de commande

# TEST_ORDER_INFO_SUCCESS
source: SUCCESS: Retrieving order information.\r\n Order Status:
de: ERFOLG: Bestellinformationen abrufen.\r\nBestellstatus:
es: ÉXITO: ​​Recuperando información del pedido.\r\nEstado del pedido:
fr: RÉUSSITE: récupération des informations de commande.\r\nÉtat de la commande:

# TEST_REFRESH_TOKEN_AUTH
source: Refresh token authentication
de: Aktualisieren Sie die Token-Authentifizierung
es: Actualizar autenticación de token
fr: Actualiser l'authentification par jeton

# TEST_SERVER_TIME_FAILURE
source: FAILURE: Server time various from current time
de: FEHLER: Serverzeit abweicht von der aktuellen Zeit
es: FALLO: hora del servidor diferente de la hora actual
fr: ÉCHEC: heure du serveur différente de l'heure actuelle

# TEST_SERVER_TIME_SUCCESS
source: SUCCESS: Server time obtained
de: ERFOLG: Serverzeit erhalten
es: ÉXITO: ​​tiempo de servidor obtenido
fr: SUCCÈS: Temps serveur obtenu

source: The NYSE is
de: Die NYSE ist
es: El NYSE es
fr: Le NYSE est

# TICKS_RETURNED
source: Ticks returned for
de: Zecken kehrten für zurück
es: Garrapatas devueltas para
fr: Tiques retournées pour

source: TO CANCEL
de: ABBRECHEN
es: CANCELAR
fr: ANNULER

source: TO CLOSE
de: SCHLIESSEN
es: CERRAR
fr: FERMER

source: Trade
de: Handel
es: Comercio
fr: Commerce

source: trade list
de: Handelsliste
es: lista de comercio
fr: liste de commerce

source: trade lists
de: Handelslisten
es: listas de comercio
fr: listes commerciales

# TRADE_NOT_FOUND_IN_XREF
source: Trade not found in x-ref list
de: Handel nicht in x-ref Liste gefunden
es: Comercio no encontrado en la lista x-ref
fr: Commerce non trouvé dans la liste x-ref

source: Unspecified error
de: Unspezifizierter Fehler
es: Error no especificado
fr: Erreur non spécifiée

# UPDATING_ASSETS_CSV
source: Updating the assets CSV file
de: Aktualisieren der CSV-Datei für Assets
es: Actualización del archivo CSV de activos
fr: Mise à jour du fichier CSV des actifs

source: Updating trade
de: Handel aktualisieren
es: Actualizando comercio
fr: Mise à jour du commerce

source: Windows Form icon not destroyed
de: Windows Form-Symbol nicht zerstört
es: El icono de Windows Form no se destruye
fr: L'icône Windows Form n'est pas détruite

# LANG_NOT_FOUND
source: Language not found (see documentation)
de: Sprache nicht gefunden (siehe Dokumentation)
es: Idioma no encontrado (ver documentación)
fr: Langue non trouvée (voir documentation)

# LANG_SPEC_INVALID
source: Invalid language specification (see documentation)
de: Ungültige Sprachspezifikation (siehe Dokumentation)
es: Especificación de lenguaje no válida (ver documentación)
fr: Spécification de langue non valide (voir la documentation)

# FUND_MINIMUM_NOT_MET
source: The minimum investment on this mutual fund has not been met
de: Die Mindestanlage in diesen Investmentfonds wurde nicht erreicht
es: La inversión mínima en este fondo mutuo no se ha cumplido
fr: L'investissement minimum sur ce fonds commun de placement n'a pas été atteint

# INVALID_ASSET_NOT_SUBSCRIBED
source: Invalid asset not added to subscription list
de: Ungültiges Asset nicht zur Abonnementliste hinzugefügt
es: Activo no válido no agregado a la lista de suscripción
fr: Élément non valide non ajouté à la liste d'abonnement

# VALID_ASSET_SUBSCRIBED
source: Valid asset added to subscription list
de: Gültiges Asset zur Abonnementliste hinzugefügt
es: Activo válido agregado a la lista de suscripción
fr: Élément valide ajouté à la liste d'abonnement

# COMBO_ORDER_FAILED_LIMIT
source: Combo leg order failed. Different LIMIT prices entered
de: Combo-Beinreihenfolge fehlgeschlagen. Unterschiedliche LIMIT-Preise eingegeben
es: Orden de pierna combinada fallida. Diferentes precios LIMIT ingresados
fr: L'ordre de l'étape combinée a échoué. Différents prix LIMIT saisis

# COMBO_ORDER_FAILED_PRICE
source: Combo leg order failed. Mixed LIMIT and MARKET orders not allowed
de: Combo-Beinreihenfolge fehlgeschlagen. Mixed LIMIT- und MARKET-Bestellungen sind nicht erlaubt
es: Orden de pierna combinada fallida. Órdenes mixtas LIMIT y MARKET no permitidas
fr: L'ordre de l'étape combinée a échoué. Ordres mixtes LIMIT et MARKET non autorisés

# FOR_MORE_LEGS
source: For more order legs
de: Für mehr Ordnung Beine
es: Para más piernas de orden
fr: Pour plus de jambes d'ordre

# GET_OPTIONS
source: Get option chain
de: Optionskette abrufen
es: Obtener cadena de opciones
fr: Obtenir la chaîne d'options

source: Saving combo option order
de: Kombioptionsreihenfolge speichern
es: Guardar orden de opción combinada
fr: Enregistrement de l'option de combo

source: Subscribing to asset
de: Asset abonnieren
es: Suscribirse al activo
fr: Abonnement à l'actif

source: WAITING
de: WARTEN
es: ESPERANDO
fr: ATTENDRE

source: Retrieving option chain
de: Optionskette abrufen
es: Recuperando la cadena de opciones
fr: Récupération de la chaîne d'options

source: Accepted
de: Akzeptiert
es: Aceptado
fr: Accepté

# AWAITING_CONDITION
source: Awaiting A Condition
de: Warten auf einen Zustand
es: En espera de una condición
fr: En attente d'une condition

source: Awaiting Manual Review
de: Warten auf manuelle Überprüfung
es: En espera de revisión manual
fr: En attente de révision manuelle

source: Awaiting Parent Order
de: Warten auf Elternauftrag
es: En espera de la orden de los padres
fr: En attente de l'ordre des parents

# AWAITING_UR_OUT
source: Awaiting Outlet
de: Warten auf Outlet
es: En espera de salida
fr: En attente de sortie

source: Expired
de: Abgelaufen
es: Caducado
fr: Expiré

source: Filled
de: Gefüllt
es: Lleno
fr: Rempli

source: Pending Activation
de: Ausstehende Aktivierung
es: Activacion Pendiente
fr: Activation en attente

# PENDING_CANCEL
source: Pending Cancellation
de: Ausstehende Stornierung
es: Cancelación pendiente
fr: Annulation en attente

# PENDING_REPLACE
source: Pending Replacement
de: Ausstehender Ersatz
es: Reemplazo pendiente
fr: Remplacement en attente

source: Queued
de: In Warteschlange
es: Puesto en cola
fr: En file d'attente

source: Replaced
de: Ersetzt
es: Reemplazado
fr: Remplacé

source: Working
de: Arbeiten
es: Trabajando
fr: Travail

# ALL_CLOSE_SUCCESS
source: All orders to close were successful
de: Alle Aufträge zum Abschluss waren erfolgreich
es: Todas las órdenes de cierre fueron exitosas
fr: Toutes les commandes de fermeture ont abouti

# BUT_NOT_CANCELED
source: But it could not be CANCELED
de: Aber es konnte nicht abgebrochen werden
es: Pero no se pudo CANCELAR
fr: Mais cela ne pouvait pas être ANNULÉ

source: It was CANCELED
de: Es wurde abgesagt
es: Fue cancelado
fr: Il a été ANNULÉ

# NOT_IN_COMBO
source: instruments may not be go in combo leg orders.\r\n Only OPTION orders may be placed in combo legs
de: Instrumente dürfen nicht in Combo-Leg-Ordnungen verwendet werden.\r\nNur OPTION-Befehle dürfen in Combo-Legs platziert werden
es: los instrumentos no pueden ir en órdenes de combo.\r\nSolo las órdenes de OPCIÓN pueden colocarse en combo.
fr: les instruments ne doivent pas être placés dans les commandes de jambes combinées.\r\n Seules les commandes OPTION peuvent être placées dans les jambes de combinaisons

# NO_LIMIT_IN_COMBO
source: No LIMIT orders within a multi-leg order
de: Keine LIMIT-Bestellungen innerhalb einer mehrbeinigen Bestellung
es: No hay pedidos LIMIT dentro de un pedido de varias etapas
fr: Aucune commande LIMIT dans une commande multi-étapes

source: Order leg
de: Bein bestellen
es: Orden de la pierna
fr: Ordre jambe

# SOME_COMBO_NOT_CLOSED
source: Some legs of this combined leg trade were not closed
de: Einige Beine dieses kombinierten Beinhandels wurden nicht geschlossen
es: Algunas piernas de este comercio combinado de piernas no estaban cerradas
fr: Certaines branches de ce commerce combiné n'ont pas été fermées

# THIS_CLOSE_SUCCESS
source: This order to close was successful
de: Dieser Auftrag zum Schließen war erfolgreich
es: Esta orden de cierre fue exitosa
fr: Cette commande a été conclue avec succès

source: This trade was
de: Dieser Handel war
es: Este comercio fue
fr: Ce commerce était

# TRADE_NOT_CLOSED
source: This trade was not closed
de: Dieser Handel wurde nicht geschlossen
es: Este comercio no fue cerrado
fr: Ce commerce n'a pas été fermé

# TRADE_NOT_CLOSED_BECAUSE
source: Trade not closed because trade was
de: Handel nicht geschlossen, weil Handel war
es: Comercio no cerrado porque el comercio era
fr: Le commerce n'a pas été fermé parce que le commerce était

source: Get asset list
de: Asset-Liste abrufen
es: Obtener lista de activos
fr: Obtenir la liste des actifs

# GET_TEST_ASSETS
source: Getting test assets
de: Test-Assets abrufen
es: Obteniendo activos de prueba
fr: Obtenir des actifs de test

# LICENSE_NOT_ACCEPTED
source: License not accepted, plug-in cannot be used
de: Lizenz nicht akzeptiert, Plug-In kann nicht verwendet werden
es: Licencia no aceptada, no se puede usar el complemento
fr: Licence non acceptée, le plug-in ne peut pas être utilisé

# MARKET_NOT_OPEN
source: Market is not open
de: Markt ist nicht geöffnet
es: El mercado no está abierto.
fr: Le marché n'est pas ouvert

# NOT_FOUND_IN_SUBSCRIPTIONS
source: not found in subscription list
de: nicht in Abonnementliste gefunden
es: no encontrado en la lista de suscripción
fr: introuvable dans la liste d'abonnement

# TABLES_NOT_CREATED
source: Database tables could not be created
de: Datenbanktabellen konnten nicht erstellt werden
es: No se pudieron crear tablas de base de datos
fr: Impossible de créer des tables de base de données

source: Trade file synchronization
de: Synchronisierung von Handelsdateien
es: Sincronización de archivos comerciales
fr: Synchronisation des fichiers commerciaux

# INFO
source: information
es: información

# TEST_BUY_SELL_INFO
source: Market BUY and SELL. LIMIT BUY and SELL...\r\nIf the NYSE is CLOSED, LIMIT and MARKET orders will be placed.\r\nIf the NYSE is OPEN, only LIMIT orders will be placed.\r\nLimit BUY and SELL placed at prices that should not be hit.\r\nSuccessful orders will be canceled immediately.
de: Markt KAUFEN und VERKAUFEN. LIMIT KAUFEN UND VERKAUFEN ...\r\nWenn die NYSE GESCHLOSSEN ist, werden LIMIT- und MARKT-Bestellungen aufgegeben.\r\nWenn die NYSE geöffnet ist werden nur LIMIT-Bestellungen aufgegeben.\r\nLimit KAUFEN und VERKAUFEN werden zu Preisen platziert das sollte nicht getroffen werden.\r\nErfolgreiche Bestellungen werden sofort storniert.

# TEST_HEADING
source: The TD Ameritrade API does not support 'paper trading,' \r\nIn DEMO mode, the plug-in runs through a variety of\r\nself-daignostic tests.
de: Die TD Ameritrade-API unterstützt keinen "Papierhandel".\r\nIm DEMO-Modus durchläuft das Plug-In eine Reihe von\r\ndaselfostischen Tests.
